# 数据切片
import pandas as pd
sale = {
    '季度':['第一季度','第一季度','第一季度','第二季度','第二季度','第二季度'],  # 竖着看 第一列 这与日常思维不同
    '区域':['华东','华北','华南','华东','华北','华南'],
    '长泰店':[90,92,88,94,92,87],
    '人民店':[91,85,89,92,88,82],
    '金寨店':[89,98,85,82,85,95],
    '临泉店':[96,90,83,85,99,80]
 }

data = pd.DataFrame(sale,index=['华东','华北','华南','华东','华北','华南'])

print(data)

# print('------------------')
# print(data['长泰店'])


print('------------------')
# 提取指定行数据
print(data.loc['华东'])
print('------------------')
print(data.iloc[1,1]) # 0 3 行列
print('------------------')
print(data.iloc[0:2]) # 左闭右开 0 1 行