import pandas as pd

sales = {

    # '区域': ['华东', '华北', '华南', '华东', '华北', '华南'],
    '长泰店': [90, 92, 88, 94, 92, 87],
    '人民店': [91, 85, 89, 92, 88, 82],
    '金寨店': [89, 98, 85, 82, 85, 95],
    '临泉店': [96, 90, 83, 85, 99, 80]
}

data = pd.DataFrame(sales, index=['华东', '华北', '华南', '华东', '华北', '华南'])

print(data)

print('------------------')

# 删除行
# print(data.drop(1)) # 删除第二行 无指定索引时使用 因为默认的索引是从0开始的
# print(data.drop('华北')) # 删除指定索引的行
# print(data.drop(['华北', '华南'])) # 删除多行
print(data.drop('人民店', axis=1)) # 删除列 参数axis=1 默认是0 删除行 1 删除列  axis 也可以写成columns 
                                            # inplace=True 直接在原数据上操作 不返回新的数据 默认是False

